results/oltp_read_only_8thr_2m/20231016-185207_3666df6342b59efa235cba994aaaba19ec85e71b_1.out
sysbench 1.1.0-2ca9e3f (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 8 tps: 207.57 qps: 3404.96 (r/w/o: 2981.84/0.00/423.13) lat (ms,99%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 8 tps: 236.05 qps: 3790.79 (r/w/o: 3318.69/0.00/472.10) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 8 tps: 244.01 qps: 3884.09 (r/w/o: 3396.07/0.00/488.01) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 8 tps: 233.00 qps: 3732.04 (r/w/o: 3266.04/0.00/466.01) lat (ms,99%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 8 tps: 234.99 qps: 3760.81 (r/w/o: 3290.84/0.00/469.98) lat (ms,99%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 8 tps: 241.00 qps: 3854.93 (r/w/o: 3372.93/0.00/481.99) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 8 tps: 235.01 qps: 3751.20 (r/w/o: 3281.17/0.00/470.02) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 8 tps: 233.00 qps: 3742.03 (r/w/o: 3276.03/0.00/466.00) lat (ms,99%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 8 tps: 241.00 qps: 3867.99 (r/w/o: 3385.99/0.00/482.00) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 249.99 qps: 3976.82 (r/w/o: 3476.84/0.00/499.98) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 8 tps: 235.01 qps: 3773.17 (r/w/o: 3303.15/0.00/470.02) lat (ms,99%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 240.99 qps: 3813.79 (r/w/o: 3331.82/0.00/481.97) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 8 tps: 246.02 qps: 3955.27 (r/w/o: 3463.24/0.00/492.03) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 8 tps: 242.00 qps: 3887.93 (r/w/o: 3403.94/0.00/483.99) lat (ms,99%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 231.92 qps: 3726.79 (r/w/o: 3262.94/0.00/463.85) lat (ms,99%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 8 tps: 234.02 qps: 3718.35 (r/w/o: 3250.31/0.00/468.04) lat (ms,99%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 8 tps: 233.05 qps: 3751.79 (r/w/o: 3285.69/0.00/466.10) lat (ms,99%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 239.00 qps: 3813.04 (r/w/o: 3335.04/0.00/478.01) lat (ms,99%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 8 tps: 234.01 qps: 3753.11 (r/w/o: 3285.10/0.00/468.01) lat (ms,99%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 237.91 qps: 3781.64 (r/w/o: 3305.81/0.00/475.83) lat (ms,99%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 8 tps: 237.08 qps: 3817.35 (r/w/o: 3343.18/0.00/474.17) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 8 tps: 249.89 qps: 3989.30 (r/w/o: 3489.51/0.00/499.79) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 8 tps: 236.10 qps: 3774.56 (r/w/o: 3302.37/0.00/472.20) lat (ms,99%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 8 tps: 237.00 qps: 3795.04 (r/w/o: 3321.03/0.00/474.00) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 235.94 qps: 3772.07 (r/w/o: 3300.19/0.00/471.88) lat (ms,99%): 58.92 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 8 tps: 241.06 qps: 3848.01 (r/w/o: 3365.88/0.00/482.13) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 8 tps: 248.00 qps: 3972.96 (r/w/o: 3476.96/0.00/495.99) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 8 tps: 242.00 qps: 3874.96 (r/w/o: 3390.96/0.00/483.99) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 8 tps: 232.94 qps: 3723.97 (r/w/o: 3258.10/0.00/465.87) lat (ms,99%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 249.07 qps: 3984.18 (r/w/o: 3486.03/0.00/498.15) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 8 tps: 242.00 qps: 3864.06 (r/w/o: 3380.05/0.00/484.01) lat (ms,99%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 8 tps: 246.00 qps: 3930.97 (r/w/o: 3438.98/0.00/492.00) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 8 tps: 246.99 qps: 3974.87 (r/w/o: 3480.89/0.00/493.98) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 8 tps: 247.01 qps: 3933.09 (r/w/o: 3439.08/0.00/494.01) lat (ms,99%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 245.00 qps: 3922.03 (r/w/o: 3432.02/0.00/490.00) lat (ms,99%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 8 tps: 242.00 qps: 3885.02 (r/w/o: 3401.02/0.00/484.00) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 8 tps: 267.00 qps: 4260.96 (r/w/o: 3726.96/0.00/533.99) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 8 tps: 274.99 qps: 4413.83 (r/w/o: 3863.85/0.00/549.98) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 8 tps: 272.01 qps: 4360.12 (r/w/o: 3816.10/0.00/544.01) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 252.00 qps: 4013.04 (r/w/o: 3509.04/0.00/504.01) lat (ms,99%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 8 tps: 249.00 qps: 3984.98 (r/w/o: 3486.98/0.00/498.00) lat (ms,99%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 8 tps: 247.00 qps: 3959.02 (r/w/o: 3465.02/0.00/494.00) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 8 tps: 237.99 qps: 3816.88 (r/w/o: 3340.90/0.00/475.99) lat (ms,99%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 8 tps: 248.99 qps: 3953.84 (r/w/o: 3455.86/0.00/497.98) lat (ms,99%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 244.01 qps: 3939.14 (r/w/o: 3451.12/0.00/488.02) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 8 tps: 247.00 qps: 3946.97 (r/w/o: 3452.98/0.00/494.00) lat (ms,99%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 8 tps: 244.00 qps: 3882.00 (r/w/o: 3394.00/0.00/488.00) lat (ms,99%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 8 tps: 256.00 qps: 4093.02 (r/w/o: 3581.02/0.00/512.00) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 8 tps: 244.00 qps: 3920.97 (r/w/o: 3432.98/0.00/488.00) lat (ms,99%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 250.99 qps: 4015.84 (r/w/o: 3513.86/0.00/501.98) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 8 tps: 243.01 qps: 3862.22 (r/w/o: 3376.19/0.00/486.03) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 8 tps: 248.94 qps: 3986.00 (r/w/o: 3488.12/0.00/497.87) lat (ms,99%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 8 tps: 241.05 qps: 3873.78 (r/w/o: 3391.68/0.00/482.10) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 8 tps: 242.01 qps: 3853.16 (r/w/o: 3369.14/0.00/484.02) lat (ms,99%): 58.92 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 258.00 qps: 4135.97 (r/w/o: 3619.97/0.00/516.00) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 8 tps: 244.01 qps: 3889.14 (r/w/o: 3401.13/0.00/488.02) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 8 tps: 247.99 qps: 4017.79 (r/w/o: 3521.82/0.00/495.97) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 8 tps: 255.01 qps: 4052.23 (r/w/o: 3542.20/0.00/510.03) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 8 tps: 243.00 qps: 3865.02 (r/w/o: 3379.02/0.00/486.00) lat (ms,99%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 246.99 qps: 3991.88 (r/w/o: 3497.90/0.00/493.99) lat (ms,99%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 8 tps: 248.95 qps: 3965.21 (r/w/o: 3467.31/0.00/497.90) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 8 tps: 250.99 qps: 4007.80 (r/w/o: 3505.83/0.00/501.98) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 8 tps: 245.06 qps: 3933.94 (r/w/o: 3443.82/0.00/490.12) lat (ms,99%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 8 tps: 250.99 qps: 4015.91 (r/w/o: 3513.92/0.00/501.99) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 8 tps: 249.00 qps: 3995.04 (r/w/o: 3497.03/0.00/498.00) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 8 tps: 247.92 qps: 3942.80 (r/w/o: 3446.95/0.00/495.85) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 8 tps: 246.03 qps: 3953.44 (r/w/o: 3461.38/0.00/492.05) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 8 tps: 250.05 qps: 4007.74 (r/w/o: 3507.65/0.00/500.09) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 8 tps: 247.01 qps: 3948.23 (r/w/o: 3454.20/0.00/494.03) lat (ms,99%): 57.87 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 256.98 qps: 4098.66 (r/w/o: 3584.70/0.00/513.96) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 8 tps: 251.02 qps: 4020.33 (r/w/o: 3518.29/0.00/502.04) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 8 tps: 247.99 qps: 3975.92 (r/w/o: 3479.93/0.00/495.99) lat (ms,99%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 8 tps: 247.00 qps: 3966.02 (r/w/o: 3472.02/0.00/494.00) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 8 tps: 251.99 qps: 3995.90 (r/w/o: 3491.91/0.00/503.99) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 8 tps: 240.01 qps: 3857.13 (r/w/o: 3377.11/0.00/480.02) lat (ms,99%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 8 tps: 240.98 qps: 3868.65 (r/w/o: 3386.69/0.00/481.96) lat (ms,99%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 8 tps: 245.01 qps: 3906.11 (r/w/o: 3416.09/0.00/490.01) lat (ms,99%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 8 tps: 254.01 qps: 4063.20 (r/w/o: 3555.18/0.00/508.03) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 8 tps: 274.01 qps: 4389.10 (r/w/o: 3841.08/0.00/548.01) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 259.00 qps: 4123.99 (r/w/o: 3605.99/0.00/518.00) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 8 tps: 250.96 qps: 4035.37 (r/w/o: 3533.45/0.00/501.92) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 8 tps: 252.04 qps: 4010.61 (r/w/o: 3506.54/0.00/504.08) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 8 tps: 264.00 qps: 4247.03 (r/w/o: 3719.02/0.00/528.00) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 8 tps: 260.99 qps: 4176.79 (r/w/o: 3654.82/0.00/521.97) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 8 tps: 251.96 qps: 4038.42 (r/w/o: 3534.49/0.00/503.93) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 8 tps: 246.99 qps: 3956.86 (r/w/o: 3462.88/0.00/493.98) lat (ms,99%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 8 tps: 254.05 qps: 4055.77 (r/w/o: 3547.67/0.00/508.10) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 8 tps: 250.94 qps: 4000.07 (r/w/o: 3498.19/0.00/501.88) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 8 tps: 253.07 qps: 4054.08 (r/w/o: 3547.95/0.00/506.13) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 255.00 qps: 4084.95 (r/w/o: 3574.95/0.00/509.99) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 8 tps: 258.99 qps: 4121.88 (r/w/o: 3603.90/0.00/517.99) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 8 tps: 261.99 qps: 4211.77 (r/w/o: 3687.79/0.00/523.97) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 8 tps: 251.02 qps: 4001.40 (r/w/o: 3499.35/0.00/502.05) lat (ms,99%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 8 tps: 270.99 qps: 4353.90 (r/w/o: 3811.91/0.00/541.99) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 8 tps: 270.93 qps: 4314.86 (r/w/o: 3773.00/0.00/541.86) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 8 tps: 255.06 qps: 4087.94 (r/w/o: 3577.82/0.00/510.12) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 8 tps: 256.02 qps: 4089.26 (r/w/o: 3577.23/0.00/512.03) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 8 tps: 254.99 qps: 4105.81 (r/w/o: 3595.83/0.00/509.98) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 8 tps: 260.01 qps: 4146.09 (r/w/o: 3626.08/0.00/520.01) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 249.01 qps: 3991.08 (r/w/o: 3493.07/0.00/498.01) lat (ms,99%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 101s ] thds: 8 tps: 256.00 qps: 4081.02 (r/w/o: 3569.02/0.00/512.00) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 102s ] thds: 8 tps: 244.99 qps: 3914.88 (r/w/o: 3424.90/0.00/489.99) lat (ms,99%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 103s ] thds: 8 tps: 253.00 qps: 4085.07 (r/w/o: 3579.06/0.00/506.01) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 104s ] thds: 8 tps: 252.98 qps: 4045.76 (r/w/o: 3539.79/0.00/505.97) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 8 tps: 252.01 qps: 4014.18 (r/w/o: 3510.16/0.00/504.02) lat (ms,99%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 106s ] thds: 8 tps: 253.86 qps: 4078.76 (r/w/o: 3571.04/0.00/507.72) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 107s ] thds: 8 tps: 261.15 qps: 4177.41 (r/w/o: 3655.11/0.00/522.30) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 108s ] thds: 8 tps: 252.98 qps: 4043.67 (r/w/o: 3537.71/0.00/505.96) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 109s ] thds: 8 tps: 254.02 qps: 4045.33 (r/w/o: 3537.29/0.00/508.04) lat (ms,99%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 262.00 qps: 4181.01 (r/w/o: 3657.01/0.00/524.00) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 111s ] thds: 8 tps: 251.00 qps: 4031.98 (r/w/o: 3529.98/0.00/502.00) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 112s ] thds: 8 tps: 254.99 qps: 4064.81 (r/w/o: 3554.84/0.00/509.98) lat (ms,99%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 113s ] thds: 8 tps: 257.93 qps: 4147.88 (r/w/o: 3632.02/0.00/515.86) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 114s ] thds: 8 tps: 258.08 qps: 4122.29 (r/w/o: 3606.13/0.00/516.16) lat (ms,99%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 8 tps: 260.00 qps: 4167.05 (r/w/o: 3647.05/0.00/520.01) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 116s ] thds: 8 tps: 257.00 qps: 4111.99 (r/w/o: 3598.99/0.00/513.00) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 117s ] thds: 8 tps: 274.00 qps: 4361.93 (r/w/o: 3812.94/0.00/548.99) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 118s ] thds: 8 tps: 282.00 qps: 4540.99 (r/w/o: 3976.99/0.00/564.00) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 119s ] thds: 8 tps: 271.00 qps: 4338.05 (r/w/o: 3796.05/0.00/542.01) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 260.00 qps: 4154.95 (r/w/o: 3634.96/0.00/519.99) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
      22.284 |                                         2
      22.689 |                                         2
      23.101 |                                         4
      23.521 |                                         13
      23.948 |                                         28
      24.384 |                                         27
      24.827 |*                                        71
      25.278 |*                                        77
      25.737 |**                                       138
      26.205 |****                                     247
      26.681 |*****                                    362
      27.165 |*********                                579
      27.659 |************                             810
      28.162 |******************                       1201
      28.673 |***********************                  1559
      29.194 |****************************             1849
      29.725 |***********************************      2319
      30.265 |***************************************  2618
      30.815 |***************************************  2610
      31.375 |**************************************** 2655
      31.945 |**************************************   2503
      32.525 |*********************************        2199
      33.116 |***************************              1773
      33.718 |********************                     1323
      34.330 |***************                          1025
      34.954 |***********                              723
      35.589 |********                                 502
      36.236 |******                                   379
      36.894 |***                                      231
      37.565 |***                                      189
      38.247 |***                                      168
      38.942 |**                                       120
      39.650 |**                                       115
      40.370 |*                                        90
      41.104 |*                                        84
      41.851 |*                                        53
      42.611 |*                                        41
      43.385 |*                                        44
      44.173 |                                         33
      44.976 |                                         27
      45.793 |*                                        35
      46.625 |*                                        42
      47.472 |*                                        46
      48.335 |*                                        85
      49.213 |**                                       108
      50.107 |**                                       121
      51.018 |**                                       151
      51.945 |**                                       137
      52.889 |**                                       110
      53.850 |*                                        80
      54.828 |*                                        75
      55.824 |*                                        44
      56.839 |                                         27
      57.871 |                                         14
      58.923 |                                         18
      59.993 |                                         7
      61.083 |                                         6
      62.193 |                                         4
      63.323 |                                         2
      64.474 |                                         4
      65.645 |                                         4
      69.289 |                                         1
      70.548 |                                         3
      71.830 |                                         1
      73.135 |                                         1
      74.464 |                                         2
      77.194 |                                         1
      86.002 |                                         1
 
SQL statistics:
    queries performed:
        read:                            418922
        write:                           0
        other:                           59846
        total:                           478768
    transactions:                        29923  (249.30 per sec.)
    queries:                             478768 (3988.75 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      249.2970
    time elapsed:                        120.0295s
    total number of events:              29923

Latency (ms):
         min:                                   22.30
         avg:                                   32.08
         max:                                   85.76
         99th percentile:                       52.89
         sum:                               960065.39

Threads fairness:
    events (avg/stddev):           3740.3750/7.16
    execution time (avg/stddev):   120.0082/0.01